# StackedWallOwnerId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Wall..::..StackedWallOwnerId Property
Wall Class See Also
---
Gets the stacked wall which contains this stacked wall member.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public ElementId StackedWallOwnerId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property StackedWallOwnerId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ StackedWallOwnerId {
	ElementId^ get ();
}
```

# See Also
Wall Class
Autodesk.Revit.DB Namespace